Revit 2024 API
UpdaterId Constructor
 creates an instance of UpdaterId for given AddInId and a given GUID value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public UpdaterId(
	AddInId addInId,
	Guid val
)
Visual Basic
Public Sub New ( _
	addInId As AddInId, _
	val As Guid _
)
Visual C++
public:
UpdaterId(
	AddInId^ addInId,
	Guid val
)
Parameters
addInId
Type: Autodesk.Revit.DB.AddInId
 Id of addin that registers an Updater
val
Type: System.Guid
 a GUID identifying the Updater within addin
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  addInId is not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UpdaterId Class
Autodesk.Revit.DB Namespace